import telebot 
from config import API
from logic_ai import get_class

bot = telebot.TeleBot(API)

@bot.message_handler(content_types=['photo'])

def get_photo(message):
    file_info = bot.get_file(message.photo[-1].file_id)
    file_name = file_info.file_path.split('/')[-1]
    downloaded_file = bot.download_file(file_info.file_path)
    with open(file_name, 'wb') as new_file:
        new_file.write(downloaded_file)
    class_name, score = get_class(file_name)
    if class_name == "Zeekr" and score > 0.7:
        bot.reply_to(message, "Это Zeekr — премиальное подразделение китайской компании Zhejiang Geely Holding Group, а также одноимённая серия электромобилей и подзаряжаемых гибридов.")
    if class_name == "BYD" and score > 0.7:
        bot.reply_to(message, "Это BYD — аббревиатура от английской фразы Build Your Dreams («построй свои мечты»). Так называется китайский конгломерат, включающий производителя автомобилей BYD Auto и производителя аккумуляторов и электроники BYD Electronic. Изначально компания специализировалась на производстве аккумуляторов для мобильных телефонов, но в 2003 году вышла на автомобильный рынок.")
    if class_name == "Xiaomi" and score > 0.7:
        bot.reply_to(message, "Это Xiaomi — компания, которая производит смартфоны, смарт-часы, электросамокаты, планшеты, телевизоры и «умную» бытовую технику. Xiaomi Auto — китайский производитель электромобилей, дочерняя компания корпорации Xiaomi. Штаб-квартира находится в Пекине. Компания была основана в 2021 году. Первым продуктом стал электромобиль Xiaomi SU7, который поступил в продажу весной 2024 года. В июле 2024 года Xiaomi Auto официально получила от китайского правительства статус независимого автопроизводителя.")
    if class_name == "NIO" and score > 0.7:
        bot.reply_to(message, "Это NIO (New Energy Vehicle Innovative Company) — китайская автомобильная компания, производитель электромобилей. Название означает «Blue Sky Coming» («Приближение голубого неба»). NIO разрабатывает и продаёт электромобили, включая седаны и внедорожники. Компания основана в ноябре 2014 года под названием NextEV Уильямом Ли (Ли Бином). Первый серийный автомобиль — спортивный электрокар NIO EP9 — представлен в ноябре 2016 года одновременно с новым брендом NIO, который позже стал названием всей компании. Массовое производство электромобилей началось летом 2018 года, первой моделью стал большой кроссовер ES8.")
    else:
        bot.reply_to(message, "К сожалению, не удалось распознать марку автомобиля, приносим свои извинения 😔")

bot.polling()